init-config.org
* Text behaviour
** Default major-mode
Usually, I tend to spend nearly all of my time in org-mode.
#+BEGIN_SRC emacs-lisp
  (setq default-major-mode 'org-mode)
#+END_SRC
** Auto-fill: automount line breaks
Auto-fill-mode enables automatic line breaks. I will set the automatic
line break to a value of 69, thereby omitting line wrapping even on
small screen-widths like on netbooks, or at screens with low
resolution.

Auto-fill-mode should basicly be started automatically for any major
skdlf mode. However, some special modes like minibuffer mode should be
excluded, so that the way to go here is with mode hooks for basically
any mode that is relevant for me.
#+BEGIN_SRC emacs-lisp
  (add-hook 'text-mode-hook 'turn-on-auto-fill)
  (add-hook 'org-mode-hook 'turn-on-auto-fill)
  (add-hook 'fundamental-mode-hook 'turn-on-auto-fill)
  (add-hook 'ess-mode-hook 'turn-on-auto-fill)
  (add-hook 'emacs-lisp-mode-hook 'turn-on-auto-fill)
  (add-hook 'message-mode-hook 'turn-on-auto-fill)
  (setq fill-column 69)
#+END_SRC
** Ex-post paragraph filling
A complete paragraph can be filled by default with "M-q".

** Delete-selection-mode
With default settings, emacs behaves different during copy-pasting
than commonly known programs like word, lyx, etc. In order to be able
to paste something such that it directly replaces a highlighted
region, delete-selection-mode has to be enabled. I will use this
behaviour globally.
#+BEGIN_SRC emacs-lisp
  (delete-selection-mode 1)               
#+END_SRC
** Copy/paste 
In order to enable emacs to interact with the standard linux
clipboard, include the following lines. Otherwise you are not able
e.g. to copy from emacs to firefox.
#+BEGIN_SRC emacs-lisp
  (setq x-select-enable-clipboard t)
  (setq interprogram-paste-function 'x-cut-buffer-or-selection-value)
#+END_SRC
* Spell checking
Enable flyspell for all org-mode buffers.
#+BEGIN_SRC emacs-lisp
(ispell-change-dictionary "american")
  (add-hook 'org-mode-hook
     (lambda()
        (ac-flyspell-workaround) ; to avoid interference with ac-mode
        (flyspell-mode t)
        )
     )
#+END_SRC

Enable switching through languages:
#+BEGIN_SRC emacs-lisp
  (defvar language)
  (setq language "english")
  
  (defun cg/switch-language ()
     "switch language for google-translate, autocomplete and ispell"
     (interactive)
     (if (string= language "english")
        (progn 
           (setq language "deutsch")
           ;(ispell-change-dictionary "deutsch")
           (flyspell-mode nil)
           (setq ac-user-dictionary-files
              '("~/.emacs.d/extensions/auto-complete/dict/german_words"))
           ; include google translate
           )
        ;; else-part
        (setq language "english")
        (flyspell-mode t)
        (ispell-change-dictionary "american")
        (setq ac-user-dictionary-files
           '("~/.emacs.d/extensions/auto-complete/dict/own_word_list"))
        ; include google translate
        )
     (message "Language switched to %s" language) 
     )
  (global-set-key (kbd "<f8>")   'cg/switch-language)
#+END_SRC
#+BEGIN_SRC emacs-lisp :tangle no
  (defun cg/switch-language ()
     "switch language for ispell and autocomplete"
     (interactive)
     (let ((dic ispell-current-dictionary))
        (if (string= dic "american")
           (progn 
              (message "in true-part")
              (setq dic "de-common")
              (ispell-change-dictionary "de_DE")
              (setq ac-user-dictionary-files
                '("~/.emacs.d/extensions/auto-complete/dict/german_words"))
                 )
           ;; else-part
           (message "in else-part")
           (setq dic "american")
           (ispell-change-dictionary "american")
           (setq ac-user-dictionary-files
             '("~/.emacs.d/extensions/auto-complete/dict/own_word_list"))
           )
        (message "Language switched to %s" dic) 
        )
     )
  (global-set-key (kbd "<f8>")   'cg/switch-language)
#+END_SRC
#+BEGIN_SRC emacs-lisp :tangle no
  (defun fd-switch-dictionary()
     (interactive)
     (let* ((dic ispell-current-dictionary)
              (change (if (string= dic "deutsch8") "english" "deutsch8")))
        (ispell-change-dictionary change)
        (message "Dictionary switched from %s to %s" dic change)
        ))
  
  (global-set-key (kbd "<f8>")   'fd-switch-dictionary)
#+END_SRC

Specify personal spelling dictionary.
#+BEGIN_SRC emacs-lisp
  (setq ispell-personal-dictionary "~/Dropbox/personal_data/.ispell_english")
#+END_SRC

* Layout
** Fonts
Depending on the screen resolution I use different default fonts. For
example, on my home screen I found DejaVuSans Condensed Bold or
Liberation Sans Bold with size 10 to be a good choice.
** Menus
In order to save precious display space, toolbars and scroll bars
shall be disabled. Moving by keybindings is faster anyways.
#+BEGIN_SRC emacs-lisp
  (if (fboundp 'scroll-bar-mode) (scroll-bar-mode -1))
  (if (fboundp 'tool-bar-mode) (tool-bar-mode -1))
#+END_SRC
However, besides line-numbers, also current column numbers shall be
shown. 
#+BEGIN_SRC emacs-lisp
  (column-number-mode 1)
#+END_SRC
** Color-theme
Following the practice of most heavy-weight programmers, I adjust my
emacs face-colors in order to have a dark-colored background and
colored letters. This allegedly should be less exhausting to the
eyes.
#+BEGIN_SRC emacs-lisp
  (add-to-list 'load-path "~/.emacs.d/extensions/color-theme-6.6.0")
  (require 'color-theme)
  (color-theme-initialize)
  (color-theme-jsc-dark)
#+END_SRC
Remark: sadly, this configuration seems to distort my auto-completion
tooltip menu.
I also like to highlight to current line and cursor point.
#+BEGIN_SRC emacs-lisp  
  (global-hl-line-mode 1)
  (set-cursor-color "red")
#+END_SRC
** Scrolling behaviour
It seems clearer to me to scroll only one line in case that cursor
leaves window boundaries.
#+BEGIN_SRC emacs-lisp  
    (setq scroll-step 1)
#+END_SRC
* Indentation
Basically all indentation should be done automatically with one
single keystroke, here "C-j". This usually will call the function
indent-for-tab-command, which claims to "indent line or region in a
proper way regarding the current major mode or insert tab."
For some special modes, however, special extensions of the function
exist. 

First, I will set the length of indentation, and the indentation
stops. 	
#+BEGIN_SRC emacs-lisp
  (setq-default tab-width 3)
  (setq-default tab-stop-list '(3 6 9 12 15 18 21 24))
  (setq-default lisp-indent-offset 3)
#+END_SRC

Now, set indentation key.
#+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "C-j") 'indent-for-tab-command)
  (define-key ac-mode-map (kbd "C-j") 'indent-for-tab-command)
  ;;(define-key ess-mode-map (kbd "C-j") 'ess-indent-command)
  
  (defun cg/ess-indent-buffer ()
     "apply ess-indent to complete buffer"
     (interactive)
     (save-excursion
        (let ((line-counter (line-number-at-pos (point-min)))
                (number-of-lines (count-lines (point-min) (point-max))))
           (goto-char (point-min))
           (while (<= line-counter number-of-lines)
              (progn
                 (ess-indent-command)
                 (forward-line)
                 (setq line-counter (+ line-counter 1))
                 )
              )
           )
        )
     )
  (defun cg/ac-indent-buffer ()
     "apply automatic indentation to complete buffer"
     (interactive)
     (save-excursion
        (let ((line-counter (line-number-at-pos (point-min)))
                (number-of-lines (count-lines (point-min) (point-max))))
           (goto-char (point-min))
           (while (<= line-counter number-of-lines)
              (progn
                 (indent-for-tab-command)
                 (forward-line)
                 (setq line-counter (+ line-counter 1))
                 )
              )
           )
        )
     )
  (global-set-key (kbd "C-M-j") 'cg/ess-indent-buffer)
  ;(define-key ess-mode-map (kbd "C-M-j") 'cg/ess-indent-buffer)
  (define-key ac-mode-map (kbd "C-M-j") 'cg/ac-indent-buffer)
#+END_SRC

Furthermore, when relying completely on automatic indentation, it
usually is more appropriate to automatically set the next line to
adequate indentation. Hence, my standard settings for new lines will
be with indentation.
#+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "RET") 'newline-and-indent)
  (global-set-key (kbd "C-M-<return>") 'newline)
  (global-set-key (kbd "C-M-S-<return>") 'indent-new-comment-line)
#+END_SRC
The following code should originally force emacs to use real TABs
instead of spaces. Furthermore, tab-to-tab-stop allows only stop at
the stops given by tab-stop-list. The function cg/insert-tab inserts
TAB at point. More sophisticated behaviour like on regions still has
to be inserted, as well as an inverting command.
#+BEGIN_SRC emacs-lisp  
  (setq-default indent-tabs-mode nil)
  (setq indent-tabs-mode nil)
  (defun cg/insert-tab ()
     "insert TAB at point"
     (interactive)
     (insert-tab)
     )
  (global-set-key (kbd "M-j") 'cg/insert-tab) 
#+END_SRC

** TODO Enable manual indentation
For some settings, however, I want to be able to manually include a
tab on a complete highlighted region or line. For example, code in
babel code blocks usually is indented. The active org-mode major
mode does not recognize language specific indentation inside of code
blocks automatically. One way always would be to use quotation on
TAB: press "C-q TAB".
Manual indentation should be bound to M-j and C-M-j.


** Indentation according to org-outline
Org documents can be indented according to their underlying outline
structure. That means, lower-level subtrees will be indented
more. However, I will rely on the default setting here, since
org-indent-mode will waste precious display space.
#+BEGIN_SRC emacs-lisp
  (org-indent-mode nil)
#+END_SRC


* Syntax-based motion and deletion
[[http://www.slac.stanford.edu/comp/unix/gnu-info/elisp_32.html][link to info about syntax tables]]
Syntax-based motion is the key to fast cursor movements. Hence, I
heavily rely on some in-built motion commands, which I slightly adapt
for customized syntax interpretation. 
Since my cursor movements mainly consist of word-based and sexp-based
syntax, I did adapt their key bindings, in order to have them set to
the best accessible keys.

** Modify syntax tables
#+BEGIN_SRC emacs-lisp
    ;; modify default syntax table
    
    (defun cg/modify-current-syntax-table ()
       (interactive)
       ;(modify-syntax-entry ?\C-\j "-") ; newline as whitespace
       (modify-syntax-entry ?. "'")
       (modify-syntax-entry ?$ "'")
       (modify-syntax-entry ?- "_")
       (modify-syntax-entry ?' "'")
       )
    
  (add-to-list 'ess-mode-hook 'cg/modify-current-syntax-table)
  (add-to-list 'julia-mode-hook 'cg/modify-current-syntax-table)
    
    (modify-syntax-entry ?\C-\j "-") ; newline as whitespace
    (modify-syntax-entry ?. "'")
    (modify-syntax-entry ?$ "'")
    (modify-syntax-entry ?- "_")
    (modify-syntax-entry ?' "'")
    

    ;; modify ess-mode syntax table
    (modify-syntax-entry ?. "'" ess-mode-syntax-table) ;; stop symbol motions at . / sexp does
                                 ;; not stop at prefixes
    (modify-syntax-entry ?$ "'" ess-mode-syntax-table) ;; stop symbol motions at $ / sexp does
                                 ;; not stop at prefixes
    (modify-syntax-entry ?- "_" ess-mode-syntax-table) ;; make symbol constituent
    (modify-syntax-entry ?' "'" ess-mode-syntax-table)
#+END_SRC
