init-config.el

(setq default-major-mode 'org-mode)

(add-hook 'text-mode-hook 'turn-on-auto-fill)
(add-hook 'org-mode-hook 'turn-on-auto-fill)
(add-hook 'fundamental-mode-hook 'turn-on-auto-fill)
(add-hook 'ess-mode-hook 'turn-on-auto-fill)
(add-hook 'emacs-lisp-mode-hook 'turn-on-auto-fill)
(add-hook 'message-mode-hook 'turn-on-auto-fill)
(setq fill-column 69)

(delete-selection-mode 1)

(if (fboundp 'scroll-bar-mode) (scroll-bar-mode -1))
(if (fboundp 'tool-bar-mode) (tool-bar-mode -1))

(column-number-mode 1)

(add-to-list 'load-path "~/.emacs.d/extensions/color-theme-6.6.0")
(require 'color-theme)
(color-theme-initialize)
(color-theme-jsc-dark)

(global-hl-line-mode 1)
(set-cursor-color "red")

(setq scroll-step 1)

(setq-default tab-width 3)
(setq-default tab-stop-list '(3 6 9 12 15 18 21 24))
(setq-default lisp-indent-offset 3)

(global-set-key (kbd "C-j") 'indent-for-tab-command)
(define-key ac-mode-map (kbd "C-j") 'indent-for-tab-command)
(define-key ess-mode-map (kbd "C-j") 'ess-indent-command)

(global-set-key (kbd "RET") 'newline-and-indent)
(global-set-key (kbd "C-M-<return>") 'newline)
(global-set-key (kbd "C-M-S-<return>") 'indent-new-comment-line)

(setq-default indent-tabs-mode nil)
(setq indent-tabs-mode nil)
(tab-to-tab-stop)
  (defun cg/insert-tab ()
    "insert TAB at point"
    (interactive)
    (insert-tab)
    )
  (global-set-key (kbd "M-j") 'cg/insert-tab)

(org-indent-mode nil)
