init-config.org
** Word-based
Word based motions and copying operations are always incorporating
"M". While basic operations are already implemented, copying
behavior based on previous motion are initialized. 
#+BEGIN_SRC emacs-lisp
  ;; (global-set-key (kbd "M-n") 'forward-word)
  ;; (global-set-key (kbd "M-p") 'backward-word)
  ;; (global-set-key (kbd "M-<backspace>") 'backward-kill-word)
  ;; (global-set-key (kbd "M-d") 'kill-word)
  (bind-key* "M-n" 'forward-word)
  (bind-key* "M-p" 'backward-word)
  (bind-key* "M-<backspace>" 'backward-kill-word)
  (bind-key* "M-d" 'kill-word)
  
  (defun cg/copy-current-word ()
     "copy word at point"
     (save-excursion
        (kill-new (word-at-point))
        (message (word-at-point)))
     )
  
  (defun cg/copy-forward-word ()
     "copy current or next word"
     (save-excursion
        (forward-word)
        (backward-word)
        (thing-at-point 'word)
        (message (thing-at-point 'word))
        )
     )
  
  (defun cg/copy-backward-word ()
     "copy current or previous word"
     (save-excursion
        (backward-word)
        (forward-word)
        (kill-new (word-at-point))
        (message (word-at-point)))
     )
  
  (defun cg/copy-word-with-direction-guess ()
     "based on last movement, try to guess whether previous or next
         word shall be copied to kill-ring"
     (interactive)
     
     ;; init list of last motions for comparison
     (setq last-motion-to-next-guess-alist
        '((forward-char    . cg/copy-forward-word)
            (forward-word     . cg/copy-forward-word)
            (forward-sexp  . cg/copy-forward-word)   
            (backward-char    . cg/copy-backward-word)
            (backward-word  . cg/copy-backward-word)
            (backward-sexp . cg/copy-backward-word)))
     ;; remark: possibly extend to search commands
     
     ;; set default value, if motions don't match
     (setq default-motion 'cg/copy-current-word)
     
     ;; store last command
     (let ((input-motion last-command)
             copy-function)
        
        ;; compare last command to list of possible motions
        (if (assoc-string input-motion last-motion-to-next-guess-alist)
           (setq copy-function (cdr (assoc-string input-motion
                                       last-motion-to-next-guess-alist)))
           ;; else: default motion
           (setq copy-function default-motion)
           )
        ;;(print copy-function)
        (funcall copy-function)
        )
     )
  
;;  (global-set-key (kbd "M-ä") 'cg/copy-word-with-direction-guess)
(bind-key* "M-ä" 'cg/copy-word-with-direction-guess)
#+END_SRC

#+BEGIN_SRC emacs-lisp
  ;; (defun sacha/search-word-backward ()
  ;;   "Find the previous occurrence of the current word."
  ;;   (interactive)
  ;;   (let ((cur (point)))
  ;;     (skip-syntax-backward "w_")
  ;;     (goto-char
  ;;      (if (re-search-backward (concat "\\_<" (current-word) "\\_>") nil t)
  ;;          (match-beginning 0)
  ;;        cur))))
#+END_SRC  
** Sexp-based

#+BEGIN_SRC emacs-lisp
    (require 'thingatpt)
    
    ;; (global-set-key (kbd "C-M-n") 'forward-sexp)
    ;; (global-set-key (kbd "C-M-p") 'backward-sexp)
    ;; (global-set-key (kbd "C-M-<backspace>") 'backward-kill-sexp)
    ;; (global-set-key (kbd "C-M-d") 'kill-sexp)
    (bind-key* "C-M-n" 'forward-sexp)
    (bind-key* "C-M-p" 'backward-sexp)
    (bind-key* "C-M-<backspace>" 'backward-kill-sexp)
    (bind-key* "C-M-d" 'kill-sexp)
  
    
  (defun cg/copy-current-sexp ()
       "copy sexp at point"
       (save-excursion
          (kill-new (thing-at-point 'sexp))
          (message (thing-at-point 'sexp)))
       )
    
    (defun cg/copy-forward-sexp ()
       "copy current or next sexp"
       (save-excursion
          (forward-sexp)
          (backward-sexp)
          (kill-new (thing-at-point 'sexp))
          (message (thing-at-point 'sexp))
          )
       )
    
    (defun cg/copy-backward-sexp ()
       "copy current or previous sexp"
       (save-excursion
          (backward-sexp)
          (forward-sexp)
          (backward-char)
          (kill-new (thing-at-point 'sexp))
          (message (thing-at-point 'sexp))
          )
       )
    
    (defun cg/copy-sexp-with-direction-guess ()
     "based on last movement, try to guess whether previous or next
     sexp shall be copied to kill-ring"
     (interactive)
     
     ;; init list of last motions for comparison
     (setq last-motion-to-next-guess-alist
     '((forward-char    . cg/copy-forward-sexp)
         (forward-word     . cg/copy-forward-sexp)
         (forward-sexp  . cg/copy-forward-sexp)   
         (backward-char    . cg/copy-backward-sexp)
         (backward-word  . cg/copy-backward-sexp)
         (backward-sexp . cg/copy-backward-sexp)))
     ;; remark: possibly extend to search commands
  
     ;; set default value, if motions don't match
     (setq default-motion 'cg/copy-current-sexp)
  
     ;; store last command
     (let ((input-motion last-command)
             copy-function)
  
        ;; compare last command to list of possible motions
        (if (assoc-string input-motion last-motion-to-next-guess-alist)
           (setq copy-function (cdr (assoc-string input-motion
        last-motion-to-next-guess-alist)))
           ;; else: default motion
           (setq copy-function default-motion)
           )
        ;;(print copy-function)
        (funcall copy-function)
        )
     )
  ;; (global-set-key (kbd "C-M-ä") 'cg/copy-sexp-with-direction-guess)
  (bind-key* "C-M-ä" 'cg/copy-sexp-with-direction-guess)
    
#+END_SRC
** Symbol-based
#+BEGIN_SRC emacs-lisp
  (defun backward-symbol ()
     "move backwards based on symbol syntax: stop at "
     (interactive)
     (skip-syntax-backward "w_")
     )
  
  (defun cg/copy-current-symbol ()
     "copy symbol at point"
     (save-excursion
        (kill-new (thing-at-point 'symbol))
        (message (thing-at-point 'symbol))
        )
     )
  
  (defun cg/kill-symbol-forward ()
     "kill symbol at point"
     (interactive)
     (let ((original-point (point)))
        (forward-symbol 1)
        (backward-symbol)
        (kill-region original-point (end-of-thing 'symbol))
        )
     )
  
  ;; (global-set-key (kbd "C-S-<backspace>") 'cg/kill-symbol-forward)
  (global-set-key (kbd "C-S-d") 'cg/kill-symbol-forward)
  
  (defun cg/copy-current-symbol ()
     "copy symbol at point"
     (save-excursion
        (kill-new (thing-at-point 'symbol))
        (message (thing-at-point 'symbol)))
     )
  
  (defun cg/copy-forward-symbol ()
     "copy current or next symbol"
     (save-excursion
        (forward-symbol)
        (backward-symbol)
        (kill-new (thing-at-point 'symbol))
        (message (thing-at-point 'symbol))
        )
     )
  
  (defun cg/copy-backward-symbol ()
     "copy current or previous symbol"
     (save-excursion
        (backward-symbol)
        (forward-symbol)
        (backward-char)
        (kill-new (thing-at-point 'symbol))
        (message (thing-at-point 'symbol))
        )
     )
  
  (defun cg/copy-symbol-with-direction-guess ()
     "based on last movement, try to guess whether previous or next
       symbol shall be copied to kill-ring"
     (interactive)
     
     ;; init list of last motions for comparison
     (setq last-motion-to-next-guess-alist
        '((forward-char    . cg/copy-forward-symbol)
            (forward-word     . cg/copy-forward-symbol)
            (forward-sexp  . cg/copy-forward-symbol)   
            (backward-char    . cg/copy-backward-symbol)
            (backward-word  . cg/copy-backward-symbol)
            (backward-sexp . cg/copy-backward-symbol)))
     ;; remark: possibly extend to search commands
     
     ;; set default value, if motions don't match
     (setq default-motion 'cg/copy-current-symbol)
     
     ;; store last command
     (let ((input-motion last-command)
             copy-function)
        
        ;; compare last command to list of possible motions
        (if (assoc-string input-motion last-motion-to-next-guess-alist)
           (setq copy-function (cdr (assoc-string input-motion
                                       last-motion-to-next-guess-alist)))
           ;; else: default motion
           (setq copy-function default-motion)
           )
        ;;(print copy-function)
        (funcall copy-function)
        )
     )
  (global-set-key (kbd "S-C-ä") 'cg/copy-symbol-with-direction-guess)
  
  
  (global-set-key (kbd "M-C-f") 'forward-symbol)
  (global-set-key (kbd "M-C-b") 'backward-symbol)
  (global-set-key (kbd "S-C-p") 'up-list)
  (global-set-key (kbd "S-C-n") 'down-list)
  
  
#+END_SRC
** Whitespace-based
#+BEGIN_SRC emacs-lisp
  
  
  (defun forward-nowhitespace (&optional other-direction)
     "required as input for nowhitespace movements with thing-at-point"
     (interactive "p")
     (if (= other-direction -1)
        (skip-syntax-backward "^->") ; no whitespaces and comment
                                     ; delimiters (in order to stop at
                                     ; newline)
        (skip-syntax-forward "^->")
        )
     )
  
  (defun cg/copy-current-nowhitespace ()
     "copy nowhitespace at point"
     (interactive)
         (save-excursion
            (kill-new (thing-at-point 'nowhitespace))
            (message (thing-at-point 'nowhitespace)))
     )
  
  (defun cg/copy-current-double-sexp ()
     "copy nowhitespace at point"
     (interactive)
         (save-excursion
            (let ((beg)
                    (end ))
               (forward-sexp 1)
               (forward-sexp -1)
               (setq beg (point))
               (forward-sexp 2)
               (setq end (point))
               (copy-region-as-kill beg end)
               )
            (message (car kill-ring)))
     )
  
  (defun cg/copy-nowhitespace-or-double-sexp ()
     "if pressed once, copy current nowhitespace, else if pressed twice, copy
     double sexp"
     (interactive)
     (let ((input-motion last-command)
             copy-function)
        (if (string= input-motion "cg/copy-nowhitespace-or-double-sexp")
           ;; increase copying region
           (setq copy-function 'cg/copy-current-double-sexp)
           (setq copy-function 'cg/copy-current-nowhitespace))
        (funcall copy-function)
        )
     )
  
  (global-set-key (kbd "C-ä") 'cg/copy-nowhitespace-or-double-sexp)
  
#+END_SRC
** Sentence-based 
Adapt sentence syntax to end with single space.
#+BEGIN_SRC emacs-lisp
  (setq sentence-end-double-space nil)
#+END_SRC
** Line based 
Enable killing to begin of line.
#+BEGIN_SRC emacs-lisp
  (defun cg/kill-start-of-line ()
    "kill from point to start of line"
    (interactive)
    (kill-line 0)
    )
  (global-set-key (kbd "M-k") 'cg/kill-start-of-line)
#+END_SRC

** Possible keys for motion / deletion / copying  
C-f -> cursor default
C-b -> cursor default
C-n -> good: cursor default
C-p -> good: cursor default
M-f -> bad: word default
M-b -> bad: word default
M-n -> good: word
M-p -> good: word
C-M-n -> good: sexp
C-M-p -> good: sexp
S-M-p -> good - doesn't work
S-M-n -> good - doesn't work
S-C-f -> good
S-C-b -> good
S-C-n -> good: symbol
S-C-p -> good: symbol

** Keybindings overview

|-----------+---------+----------|
| item      | command | shortcut |
|-----------+---------+----------|
| pointwise |         |          |
|-----------+---------+----------|
|           | forw    | C-f      |
|           | backw   | C-b      |
|           | up      | C-p      |
|           | down    | C-n      |
| deletion  |         |          |
|           | forw    | C-d      |
|           | backw   | C-DEL    |
|           | backw   | DEL      |
|-----------+---------+----------|
| words           |       |         |
|-----------------+-------+---------|
|                 | forw  | M-n     |
|                 | backw | M-p     |
| deletion        |       |         |
|                 | forw  | M-d     |
|                 | backw | M-DEL   |
|-----------------+-------+---------|
| line            |       |         |
|-----------------+-------+---------|
|                 | forw  | C-e     |
|                 | backw | C-a     |
| deletion        |       |         |
|                 | forw  | C-k     |
|                 | backw | C-DEL   |
|                 | backw | M-k     |
|-----------------+-------+---------|
| sentence        |       |         |
|-----------------+-------+---------|
|                 | forw  | M-e     |
|                 | backw | M-a     |
| deletion        |       |         |
|                 | forw  |         |
|                 | backw |         |
|-----------------+-------+---------|
| sexp            |       |         |
|-----------------+-------+---------|
|                 | forw  | C-M-n   |
|                 | backw | C-M-p   |
| deletion        |       |         |
|                 | forw  | C-M-d   |
|                 | backw | C-M-DEL |
|-----------------+-------+---------|
| non-white-space |       |         |
|-----------------+-------+---------|
|                 | forw  | S-C-f   |
|                 | backw | S-C-b   |
| deletion        |       |         |
|                 | forw  | S-C-D   |
|                 | backw | S-C-DEL |

* Windows and buffers

** Source code block
Since I encounter source code blocks very often, I changed the
step-in / step-out keybind, since the default C-c '-setting is too
long for me.
#+BEGIN_SRC emacs-lisp  
  (define-key org-mode-map (kbd "C-ü") 'org-edit-special)
  (define-key org-src-mode-map (kbd "C-ü") 'org-edit-src-exit)
#+END_SRC

** Other window
Also one of my most frequently used functions.  Hence, faster
keybinding is used, as well as for inverse direction.
#+BEGIN_SRC emacs-lisp
    (global-set-key (kbd "M-SPC") 'other-window)
    (defun cg/inverse-other-window ()
      "window cycling in inverse direction"
       (interactive)
      (other-window -1)
      )
    (global-set-key (kbd "M-S-SPC") 'cg/inverse-other-window)
#+END_SRC

** Window resize operations
Often it is necessary to resize, create and delete windows. Possible
keybindings here are:
- C-+
- M-+
- C-x +
- C-x C-+
Probably something like text-scale-adjust would be desirable, where I
start adjustment mode once, and then I'm able to perform increase and
decrease operations with + and -, and equal size with =, and default
size with 0.
