init-config.el

(global-set-key (kbd "M-n") 'forward-word)
(global-set-key (kbd "M-p") 'backward-word)
(global-set-key (kbd "M-<backspace>") 'backward-kill-word)
(global-set-key (kbd "M-d") 'kill-word)

(global-set-key (kbd "C-M-n") 'forward-sexp)
(global-set-key (kbd "C-M-p") 'backward-sexp)
(global-set-key (kbd "C-M-<backspace>") 'backward-kill-sexp)
(global-set-key (kbd "C-M-d") 'kill-sexp)

(setq sentence-end-double-space nil)

(defun cg/kill-start-of-line ()
  "kill from point to start of line"
  (interactive)
  (kill-line 0)
  )
(global-set-key (kbd "M-k") 'cg/kill-start-of-line)

(define-key org-mode-map (kbd "C-ü") 'org-edit-special)
(define-key org-src-mode-map (kbd "C-ü") 'org-edit-src-exit)

(global-set-key (kbd "M-SPC") 'other-window)
(defun cg/inverse-other-window ()
  "window cycling in inverse direction"
  (other-window -1)
  )
(global-set-key (kbd "M-S-SPC") 'cg/inverse-other-window)
