init-config.org
*** Current window
Increase current window by two lines, either horizontally or
vertically. 
#+BEGIN_SRC emacs-lisp
  (defun cg/increase-current-window ()
    "Increase current window by two lines"
    (interactive)
    (enlarge-window 2)
    )
  (global-set-key (kbd "C-+") 'cg/increase-current-window)
#+END_SRC
Decrease current window.
#+BEGIN_SRC emacs-lisp
  (defun cg/decrease-current-window ()
    "Decrease current window by two lines"
    (interactive)
    (other-window 1)
    (enlarge-window 2)
    (other-window -1)
    )
  (global-set-key (kbd "M-+") 'cg/decrease-current-window)
#+END_SRC
Toogle major window: given that two windows exist, alternately
increase other window. This function is helpful for when one window
contains a code script, while the second one contains a console.
#+BEGIN_SRC emacs-lisp
  (defun toggle-major-window ()
    "Set focus on second window, and enlargen it
  to cover about 3/4 of overall area"
    (interactive)
    (if (not (one-window-p))              ; if more than one window
        (progn
          (other-window 1)                ; switch to other window
          (balance-windows)               ; split overall area equally
          (enlarge-window 8))))           ; enlargen current window by 8 lines
      (global-set-key (kbd "C-M-+") 'toggle-major-window)
#+END_SRC

*** Operations on other-window
The operations here could be: open buffer, file or directory in other
window. Scroll other window, set focus in other window, kill other
window, kill buffer in other window, kill both.
#+BEGIN_SRC emacs-lisp
(defun set-focus-lower-window ()
  "Move focus of lower window so that last line of buffer
exactly matches last line of frame"
    (interactive)
    (if (not (one-window-p))		; if more than one window
    (progn
      (other-window 1)			; move point to second window
      (end-of-buffer)			; go to end of buffer
      (recenter -1)			; move point to last line of frame
      (other-window 1))))		; move point back again
(global-set-key (kbd "C-x C-l") 'set-focus-lower-window)
#+END_SRC





(global-set-key (kbd "C-x t") 'kill-buffer-and-window)

(defun kill-other-buffer-and-window ()
  "Kill other window with buffer also."
  (interactive)
  (other-window 1)
  (kill-buffer-and-window))

(global-set-key (kbd "C-x C-t") 'kill-other-buffer-and-window)

(defun open-pic-at-point ()
  "Open link to pic in horizontally splitted window."
  (interactive)
  (split-window-horizontally)
  (org-open-at-point))

(global-set-key (kbd "C-x C-o") 'open-pic-at-point)
(image-mode)
(define-key image-mode-map (kbd "k") 'kill-buffer-and-window)
(emacs-lisp-mode)

** Buffers
Since I only very seldomly use list-buffers, I rebound the key to
the command ido-switch-buffer-other-window, which allows to choose a
buffer for the second window. If no other window exists, a
horizontal split will be conducted, and the chosen buffer will be
inserted in the newly opened window.
#+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "C-x C-b") 'ido-switch-buffer-other-window)
  (global-set-key (kbd "C-x C-d") 'dired-other-window)
  (global-set-key (kbd "C-x C-f") 'ido-find-file-other-window)
  (global-set-key (kbd "C-x 4 b") 'list-buffers)
#+END_SRC

*** File opening
As already have set default settings for auto-fill-mode, which I
adjust only very seldomly, there is no need for me to keep
set-fill-column as key binding. Hence, to comply with my buffer
settings, I rebind ido-find-file.
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-x f") 'ido-find-file)
#+END_SRC
This way, after some familiarization, I can bind
ido-find-file-other-window to "C-x C-f".

* Commenting
Although emacs already is equipped quite sophisticated
do-what-I-mean commenting powers, I still want to be able to toggle
between commented and uncommented for the current line or highlighted
region. I bound the command to "C-#" since many command languages
use # as comment symbol. Another natural choice would be "M-," which
is more in resemblance to the emacs commenting binding "S-M-;".
#+BEGIN_SRC emacs-lisp
  (defun comment-or-uncomment-line ()
    (interactive)
    (comment-or-uncomment-region (line-beginning-position)
                                 (line-end-position)))
  (global-set-key (kbd "C-#") 'comment-or-uncomment-line)
  (define-key org-mode-map (kbd "C-#") 'comment-or-uncomment-line)
#+END_SRC
Keep in mind that in order to extend existing comments into the next
line you can use indent-new-comment-line bound to "M-S-RET".

* Misc
Enable emacsclient
#+BEGIN_SRC emacs-lisp
(server-start)
#+END_SRC

(custom-set-variables
  ;; custom-set-variables was added by Custom.
  ;; If you edit it by hand, you could mess it up, so be careful.
  ;; Your init file should contain only one such instance.
  ;; If there is more than one, they won't work right.
 '(canlock-password "7c5426993fd9b0f7c6f57a98e8fed4b718bc46ba")
 '(org-agenda-ndays 14)
 '(org-agenda-show-all-dates t)
 '(org-agenda-skip-deadline-if-done t)
 '(org-agenda-skip-scheduled-if-done t)
 '(org-agenda-start-on-weekday nil)
 '(org-deadline-warning-days 14)
 '(org-fast-tag-selection-single-key nil)
 '(org-reverse-note-order nil))
(custom-set-faces
  ;; custom-set-faces was added by Custom.
  ;; If you edit it by hand, you could mess it up, so be careful.
  ;; Your init file should contain only one such instance.
  ;; If there is more than one, they won't work right.
 )
(setq x-select-enable-clipboard t)
