init-config.el

(defun cg/increase-current-window ()
  "Increase current window by two lines"
  (interactive)
  (enlarge-window 2)
  )
(global-set-key (kbd "C-+") 'cg/increase-current-window)

(defun cg/decrease-current-window ()
  "Decrease current window by two lines"
  (interactive)
  (other-window 1)
  (enlarge-window 2)
  (other-window -1)
  )
(global-set-key (kbd "M-+") 'cg/decrease-current-window)

(defun toggle-major-window ()
  "Set focus on second window, and enlargen it
to cover about 3/4 of overall area"
  (interactive)
  (if (not (one-window-p))              ; if more than one window
      (progn
        (other-window 1)                ; switch to other window
        (balance-windows)               ; split overall area equally
        (enlarge-window 8))))           ; enlargen current window by 8 lines
    (global-set-key (kbd "C-M-+") 'toggle-major-window)

(defun set-focus-lower-window ()
  "Move focus of lower window so that last line of buffer
exactly matches last line of frame"
    (interactive)
    (if (not (one-window-p))            ; if more than one window
    (progn
      (other-window 1)                  ; move point to second window
      (end-of-buffer)                   ; go to end of buffer
      (recenter -1)                     ; move point to last line of frame
      (other-window 1))))               ; move point back again
(global-set-key (kbd "C-x C-l") 'set-focus-lower-window)

(global-set-key (kbd "C-x C-b") 'ido-switch-buffer-other-window)
(global-set-key (kbd "C-x C-d") 'dired-other-window)
(global-set-key (kbd "C-x C-f") 'ido-find-file-other-window)
(global-set-key (kbd "C-x 4 b") 'list-buffers)

(global-set-key (kbd "C-x f") 'ido-find-file)

(defun comment-or-uncomment-line ()
  (interactive)
  (comment-or-uncomment-region (line-beginning-position)
                               (line-end-position)))
(global-set-key (kbd "C-#") 'comment-or-uncomment-line)
(define-key org-mode-map (kbd "C-#") 'comment-or-uncomment-line)
